Repository: bseverns/classhub
Catalog: services/classhub/locale/*/LC_MESSAGES/django.po
Languages: es

source: Join Class
es: Unirse a la clase

source: Skip to main content
es: Ir al contenido principal

source: Join your class
es: Únete a tu clase

source: Enter your class code and pick a display name.
es: Ingresa tu código de clase y elige un nombre para mostrar.

source: Enter the class code from your teacher. Pick any display name you like.
es: Ingresa el código de clase de tu maestro. Elige el nombre que quieras.

source: On shared devices, enter your return code so you do not join as another student.
es: En dispositivos compartidos, ingresa tu código de retorno para no unirte como otro estudiante.

source: Same classroom device? You can usually leave return code blank.
es: u00bfMismo dispositivo del salu00f3n? Generalmente puedes dejar el cu00f3digo de retorno en blanco.

source: On shared devices, use your own return code to avoid signing in as someone else.
es: En dispositivos compartidos, usa tu propio código de retorno para no iniciar sesión como otra persona.

source: Class code
es: Código de clase

source: Your display name
es: Tu nombre para mostrar

source: A nickname or made-up name is fine — no need to use your real name.
es: Un apodo o nombre inventado está bien — no necesitas usar tu nombre real.

source: Return code (optional)
es: Código de retorno (opcional)

source: If your class uses icon codes, use the icon keypad below.
es: Si tu clase usa códigos de íconos, usa el teclado de íconos de abajo.

source: Show icon keypad
es: Mostrar teclado de íconos

source: Clear return code
es: Borrar código de retorno

source: Return code icon keypad
es: Teclado de íconos de código de retorno

source: Join class
es: Unirse a la clase

source: Privacy at a glance:
es: Privacidad en resumen:

source: We store your display name, class submissions, and event timestamps.
es: Almacenamos tu nombre para mostrar, entregas de clase y marcas de tiempo.

source: Storage location: %(location)s
es: Ubicación del almacenamiento: %(location)s

source: Retention:
es: Retención:

source: submissions are kept up to %(counter)s day unless deleted sooner.
es: las entregas se conservan hasta %(counter)s du00eda a menos que se eliminen antes.

source: submissions stay until a teacher or admin removes them.
es: las entregas permanecen hasta que un maestro o administrador las elimine.

source: Delete now: after joining, open <a href="/student/my-data">My Data</a> to delete your work or end this device session.
es: Eliminar ahora: despuu00e9s de unirte, abre <a href="/student/my-data">Mis datos</a>.

source: Teacher? Use <a href="/teach">/teach</a>.
es: ¿Maestro? Usa <a href="/teach">/teach</a>.

source: Teacher Login
es: Inicio de sesión del maestro

source: Home
es: Inicio

source: Sign in to your account
es: Inicia sesión en tu cuenta

source: Log in
es: Iniciar sesión

source: Language
es: Idioma

source: Switch
es: Cambiar

source: That invite link is not valid.
es: Ese enlace de invitación no es válido.

source: That invite link has been disabled.
es: Ese enlace de invitación ha sido desactivado.

source: That invite link has expired.
es: Ese enlace de invitación ha expirado.

source: This invite is full right now. Ask your teacher for a new invite link.
es: Esta invitación está llena en este momento. Pide a tu maestro un nuevo enlace de invitación.

source: That invite link is not usable right now.
es: Ese enlace de invitación no se puede usar en este momento.

source: That looks like an email address. Please use a nickname or display name instead.
es: Eso parece una dirección de correo electrónico. Por favor, usa un apodo o nombre para mostrar.

source: That looks like a phone number. Please use a nickname or display name instead.
es: Eso parece un número de teléfono. Por favor, usa un apodo o nombre para mostrar.

source: Please use a nickname or display name instead of personal information.
es: Por favor, usa un apodo o nombre para mostrar en lugar de información personal.

source: Heads-up: that looks like an email address. A nickname is safer.
es: Aviso: eso parece una dirección de correo electrónico. Un apodo es más seguro.

source: Heads-up: that looks like a phone number. A nickname is safer.
es: Aviso: eso parece un número de teléfono. Un apodo es más seguro.

source: Consider using a nickname instead of personal information.
es: Considera usar un apodo en lugar de información personal.

source: You are joining <strong>%(class_name)s</strong> by invite link.
es: Te estás uniendo a <strong>%(class_name)s</strong> por enlace de invitación.

source: Storage location:
es: Ubicación del almacenamiento:

source: day(s). Deleted sooner on request.
es: día(s). Se eliminan antes si se solicita.

source: Delete now:
es: Eliminar ahora:

source: My Data
es: Mis datos

source: delete your work or end session.
es: eliminar tu trabajo o terminar sesión.

source: Student home
es: Inicio del estudiante

source: Join page
es: Página de unirse

source: Export my portfolio
es: Exportar mi portafolio

source: Privacy
es: Privacidad

source: Signed in as
es: Conectado como

source: Code
es: Código

source: Copy class code
es: Copiar código de clase

source: Your return code:
es: Tu código de retorno:

source: Show return code
es: Mostrar código de retorno

source: Hide return code
es: Ocultar código de retorno

source: Show
es: Mostrar

source: Copy return code
es: Copiar código de retorno

source: for rejoin
es: para reunirse

source: Log out
es: Cerrar sesión

source: This week
es: Esta semana

source: This week's highlighted lesson
es: Lección destacada de esta semana

source: Highlighted lesson
es: Lección destacada

source: Start this week's lesson
es: Comenzar la lección de esta semana

source: Locked
es: Bloqueado

source: Open
es: Abierto

source: No calendar-linked lessons yet. Ask your teacher when your first lesson opens.
es: Aún no hay lecciones vinculadas al calendario. Pregunta a tu maestro cuándo abre tu primera lección.

source: Course links
es: Enlaces del curso

source: View full course lesson links
es: Ver todos los enlaces de lecciones del curso

source: Course lesson links will appear here after your teacher connects a course.
es: Los enlaces de lecciones del curso aparecerán aquí después de que tu maestro conecte un curso.

source: How to tell you are done
es: Cómo saber que terminaste

source: Open lesson
es: Abrir lección

source: Upload / view submissions
es: Subir / ver entregas

source: Upload / manage gallery
es: Subir / administrar galería

source: Save checklist
es: Guardar lista de verificación

source: Save reflection
es: Guardar reflexión

source: Save rubric
es: Guardar rúbrica

source: Account
es: Cuenta

source: End my session on this device
es: Terminar mi sesión en este dispositivo

source: Back to class
es: Volver a la clase

source: Privacy at a glance
es: Privacidad en resumen

source: Stored data: your display name, submissions, and class event timestamps.
es: Datos almacenados: tu nombre para mostrar, entregas y marcas de tiempo de clase.

source: Download my work
es: Descargar mi trabajo

source: Delete all of your submissions now?
es: ¿Eliminar todas tus entregas ahora?

source: Delete my work now
es: Eliminar mi trabajo ahora

source: My submissions
es: Mis entregas

source: When
es: Cuándo

source: Module
es: Módulo

source: File
es: Archivo

source: Download
es: Descargar

source: No submissions stored yet.
es: Aún no hay entregas almacenadas.

source: Privacy Information
es: Información de privacidad

source: How we handle your data on
es: Cómo manejamos tus datos en

source: 1. What data is collected
es: 1. Qué datos se recopilan

source: We design this platform to collect as little about you as possible.
es: Diseñamos esta plataforma para recopilar lo menos posible sobre ti.

source: Don't upload sensitive documents
es: No subas documentos confidenciales

source: 2. How to export or delete your work
es: 2. Cómo exportar o eliminar tu trabajo

source: You own your artifacts. While in an active session, you can export or delete your files at any time.
es: Eres dueño de tus archivos. Mientras tengas una sesión activa, puedes exportar o eliminar tus archivos en cualquier momento.

source: 3. What gets deleted and when
es: 3. Qué se elimina y cuándo

source: We don't hold on to your data forever.
es: No guardamos tus datos para siempre.

source: Lessons
es: Lecciones

source: Back to join
es: Volver a unirse
